In [6]:
import pandas as pd
import numpy as np

In [4]:
data = {
    "x":[1, 2, 3],
    "y":[4, 5, 6]
}

df = pd.DataFrame(data)
df

   x  y
0  1  4
1  2  5
2  3  6

In [5]:
type(df)

pandas.core.frame.DataFrame

In [14]:
data = {
    "Col1": np.linspace(1, 100, 20),
    "Col2": np.linspace(1, 1000, 20)
}

df = pd.DataFrame(data)
df.head(2)

       Col1       Col2
0  1.000000   1.000000
1  6.210526  53.578947

In [16]:
df["Col1"][-3:]

0     1.000000
1     6.210526
2    11.421053
Name: Col1, dtype: float64

In [17]:
type(df["Col1"])

pandas.core.series.Series

In [19]:
df.Col2.dtype

dtype('float64')

In [20]:
df.describe()

             Col1         Col2
count   20.000000    20.000000
mean    50.500000   500.500000
std     30.825889   311.061248
min      1.000000     1.000000
25%     25.750000   250.750000
50%     50.500000   500.500000
75%     75.250000   750.250000
max    100.000000  1000.000000

In [24]:
df.drop(1, inplace=True)

In [29]:
df = df.reset_index(drop=True)
df

          Col1         Col2
0     1.000000     1.000000
1    11.421053   106.157895
2    16.631579   158.736842
3    21.842105   211.315789
4    27.052632   263.894737
5    32.263158   316.473684
6    37.473684   369.052632
7    42.684211   421.631579
8    47.894737   474.210526
9    53.105263   526.789474
10   58.315789   579.368421
11   63.526316   631.947368
12   68.736842   684.526316
13   73.947368   737.105263
14   79.157895   789.684211
15   84.368421   842.263158
16   89.578947   894.842105
17   94.789474   947.421053
18  100.000000  1000.000000

In [35]:
df.drop(df.columns[1], axis=1)

          Col1
0     1.000000
1    11.421053
2    16.631579
3    21.842105
4    27.052632
5    32.263158
6    37.473684
7    42.684211
8    47.894737
9    53.105263
10   58.315789
11   63.526316
12   68.736842
13   73.947368
14   79.157895
15   84.368421
16   89.578947
17   94.789474
18  100.000000